import { component$ } from '@builder.io/qwik';
import styles from './AboutContent.module.scss';
import Title from '~/components/Title';

export default component$(() => {
    return (
        <div class={'container ' + styles.dietWrapper}>
            <Title>Загальна інформація</Title>
            <div class={styles.subTitle}>Зв'язок між тренуванням і дієтою</div>
            <p class={styles.text}>Тренування та дієта є взаємопов'язаними аспектами для досягнення оптимального здоров'я. Правильно підібрана дієта може підтримувати енергетичний баланс, необхідний для ефективних тренувань, та забезпечувати необхідні поживні речовини для відновлення після фізичних навантажень. З іншого боку, регулярні тренування покращують обмін речовин та сприяють збалансованому фізичному стану, що може впливати на апетит та вибір їжі.</p>
            <p class={styles.text}>Тренування збільшує енергетичні потреби організму, і правильна дієта допомагає задовольнити ці потреби, сприяючи ефективному відновленню та розвитку м'язової маси. При цьому важливо уникати надмірного дефіциту калорій або надмірного споживання, щоб уникнути втоми та недостатньої ефективності тренувань.</p>
            <div class={styles.subTitle}>Психологічний вплив</div>
            <p class={styles.text}>Тренування та дієта мають значущий психологічний вплив на емоційний стан та загальне самопочуття. Фізична активність сприяє виробленню ендорфінів, які викликають відчуття щастя та зменшують стрес. Регулярні тренування можуть покращити настрій, знизити рівень тривоги та депресії, а також підвищити самоповагу.</p>
            <p class={styles.text}>Дієта також може впливати на психічний стан. Наприклад, продукти з високим рівнем цукру можуть спричиняти коливання настрою, тоді як збалансована дієта з корисними поживними речовинами може підтримувати стабільний психічний стан.</p>
            <div class={styles.subTitle}>Наукові докази:</div>
            <p class={styles.text}>Існує багато наукових досліджень, що підтверджують важливість взаємодії тренувань та дієти для досягнення оптимального здоров'я. Наприклад, дослідження показують, що комбінація правильної дієти та регулярного фізичного навантаження сприяє збереженню здоров'я серця, знижує ризик хронічних захворювань та підтримує здоровий ваговий стан.</p>
            <p class={styles.text}>Наукові дані також підтверджують, що фізична активність може впливати на обмін речовин, підвищувати чутливість до інсуліну та сприяти ефективнішому використанню енергії. Такі взаємодії сприяють оптимізації здоров'я та загального благополуччя.</p>
            
            <p class={styles.text}></p>
        </div>
    );
});
